; domain
(define (domain grid)
  (:requirements :strips)
  (:predicates
    ; types
    (place ?x)
    (key ?k)
    (shape ?s)
    ; static predicates
    (conn ?x ?y)
    (key-shape ?k ?s)
    (lock-shape ?x ?s)
    ; fluents
    (at ?k ?x)
    (at-robot ?x)
    (holding ?k)
    (arm-empty)
    (locked ?x)
    (open ?x)
  )

  ; move from ?curpos to adjacent ?nextpos that is open
  (:action move
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos)
                       (place ?nextpos)
                       (conn ?curpos ?nextpos)
                       (at-robot ?curpos)
                       (open ?nextpos))
    :effect (and (at-robot ?nextpos)
                 (not (at-robot ?curpos))))

  ; pick ?key that is at ?curpos when not holding another key
  (:action pickup
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos)
                       (key ?key)
                       (at ?key ?curpos)
                       (at-robot ?curpos)
                       (arm-empty))
    :effect (and (holding ?key)
                 (not (at ?key ?curpos))
                 (not (arm-empty))))

  ; pick ?newkey at ?curpos while holding/dropping ?oldkey (equiv. to putdown followed by pickup)
  (:action pickup-and-loose
    :parameters (?curpos ?newkey ?oldkey)
    :precondition (and (place ?curpos)
                       (key ?newkey)
                       (key ?oldkey)
                       (at ?newkey ?curpos)
                       (at-robot ?curpos)
                       (holding ?oldkey))
    :effect (and (holding ?newkey)
                 (at ?oldkey ?curpos)
                 (not (holding ?oldkey))
                 (not (at ?newkey ?curpos))))

  ; putdown ?key being held at ?curpos
  (:action putdown
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos)
                       (key ?key)
                       (at-robot ?curpos)
                       (holding ?key))
    :effect (and (arm-empty)
                 (at ?key ?curpos)
                 (not (holding ?key))))

  ; unlock ?lockpos adjacent to ?curpos using ?key begin held of matching ?shape
  (:action unlock
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos)
                       (place ?lockpos)
                       (key ?key)
                       (shape ?shape)
                       (conn ?curpos ?lockpos)
                       (key-shape ?key ?shape)
                       (lock-shape ?lockpos ?shape)
                       (at-robot ?curpos)
                       (locked ?lockpos)
                       (holding ?key))
    :effect (and (open ?lockpos)
                 (not (locked ?lockpos))))
)

; problem
(define (problem grid_9room2_fpl_s3_seed16266_n0)
  (:domain grid)
  (:objects
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 p25 p26 p27 p28 p29 p30 p31 p32 p33 p34 p35 p36 p37 p38 p39 p40 p41 p42 p43 p44
    shape0 shape1 shape2
    key0 key1 key2
  )
  (:init
    ; Object types
    (place p0) (place p1) (place p2) (place p3) (place p4) (place p5) (place p6) (place p7) (place p8) (place p9) (place p10) (place p11) (place p12) (place p13) (place p14) (place p15) (place p16) (place p17) (place p18) (place p19) (place p20) (place p21) (place p22) (place p23) (place p24) (place p25) (place p26) (place p27) (place p28) (place p29) (place p30) (place p31) (place p32) (place p33) (place p34) (place p35) (place p36) (place p37) (place p38) (place p39) (place p40) (place p41) (place p42) (place p43) (place p44)
    (shape shape0) (shape shape1) (shape shape2)
    (key key0) (key key1) (key key2)
    ; Open/locked cells
    (open p0) (open p1) (open p3) (open p4) (open p5) (open p6) (open p7) (open p8) (open p9) (open p10) (open p12) (open p13) (open p16) (open p17) (open p19) (open p20) (open p21) (open p22) (open p23) (open p24) (open p25) (open p26) (open p28) (open p29) (open p31) (open p32) (open p33) (open p34) (open p36) (open p37) (open p38) (open p39) (open p41) (open p42) (open p43) (open p44)
    (locked p2) (locked p11) (locked p14) (locked p15) (locked p18) (locked p27) (locked p30) (locked p35) (locked p40)
    ; Connected cells
    (conn p0 p1)
    (conn p0 p7)
    (conn p1 p0)
    (conn p1 p2)
    (conn p1 p8)
    (conn p2 p1)
    (conn p2 p3)
    (conn p3 p2)
    (conn p3 p4)
    (conn p3 p9)
    (conn p4 p3)
    (conn p4 p10)
    (conn p5 p6)
    (conn p5 p12)
    (conn p6 p5)
    (conn p6 p13)
    (conn p7 p0)
    (conn p7 p8)
    (conn p7 p14)
    (conn p8 p7)
    (conn p8 p1)
    (conn p9 p3)
    (conn p9 p10)
    (conn p10 p9)
    (conn p10 p4)
    (conn p10 p11)
    (conn p11 p10)
    (conn p11 p12)
    (conn p12 p11)
    (conn p12 p5)
    (conn p12 p13)
    (conn p13 p12)
    (conn p13 p6)
    (conn p13 p15)
    (conn p14 p7)
    (conn p14 p16)
    (conn p15 p13)
    (conn p15 p22)
    (conn p16 p14)
    (conn p16 p17)
    (conn p16 p23)
    (conn p17 p16)
    (conn p17 p18)
    (conn p17 p24)
    (conn p18 p17)
    (conn p18 p19)
    (conn p19 p18)
    (conn p19 p20)
    (conn p19 p25)
    (conn p20 p19)
    (conn p20 p26)
    (conn p21 p22)
    (conn p21 p28)
    (conn p22 p21)
    (conn p22 p15)
    (conn p22 p29)
    (conn p23 p16)
    (conn p23 p24)
    (conn p24 p23)
    (conn p24 p17)
    (conn p24 p30)
    (conn p25 p19)
    (conn p25 p26)
    (conn p26 p25)
    (conn p26 p20)
    (conn p26 p27)
    (conn p27 p26)
    (conn p27 p28)
    (conn p28 p27)
    (conn p28 p21)
    (conn p28 p29)
    (conn p29 p28)
    (conn p29 p22)
    (conn p30 p24)
    (conn p30 p32)
    (conn p31 p32)
    (conn p31 p38)
    (conn p32 p31)
    (conn p32 p30)
    (conn p32 p39)
    (conn p33 p34)
    (conn p33 p41)
    (conn p34 p33)
    (conn p34 p35)
    (conn p34 p42)
    (conn p35 p34)
    (conn p35 p36)
    (conn p36 p35)
    (conn p36 p37)
    (conn p36 p43)
    (conn p37 p36)
    (conn p37 p44)
    (conn p38 p31)
    (conn p38 p39)
    (conn p39 p38)
    (conn p39 p32)
    (conn p39 p40)
    (conn p40 p39)
    (conn p40 p41)
    (conn p41 p40)
    (conn p41 p33)
    (conn p41 p42)
    (conn p42 p41)
    (conn p42 p34)
    (conn p43 p36)
    (conn p43 p44)
    (conn p44 p43)
    (conn p44 p37)
    ; Lock and key shapes
    (lock-shape p40 shape2)
    (lock-shape p30 shape0)
    (lock-shape p27 shape1)
    (lock-shape p2 shape1)
    (lock-shape p11 shape1)
    (lock-shape p18 shape1)
    (lock-shape p14 shape0)
    (lock-shape p35 shape2)
    (lock-shape p15 shape1)
    (key-shape key0 shape0)
    (key-shape key1 shape1)
    (key-shape key2 shape2)
    ; Key placement
    (at key0 p22)
    (at key1 p5)
    (at key2 p18)
    ; Robot placement
    (at-robot p13)
    (arm-empty)
  )
  (:goal (at-robot p34))
)

; plan
1. (move p13 p12)
   deleted: (at-robot p13)
   added: (at-robot p12)
   goals met: 0 of 1
2. (move p12 p5)
   deleted: (at-robot p12)
   added: (at-robot p5)
   goals met: 0 of 1
3. (pickup p5 key1)
   deleted: (at key1 p5) (arm-empty)
   added: (holding key1)
   goals met: 0 of 1
4. (move p5 p12)
   deleted: (at-robot p5)
   added: (at-robot p12)
   goals met: 0 of 1
5. (move p12 p13)
   deleted: (at-robot p12)
   added: (at-robot p13)
   goals met: 0 of 1
6. (unlock p13 p15 key1 shape1)
   deleted: (locked p15)
   added: (open p15)
   goals met: 0 of 1
7. (move p13 p15)
   deleted: (at-robot p13)
   added: (at-robot p15)
   goals met: 0 of 1
8. (move p15 p22)
   deleted: (at-robot p15)
   added: (at-robot p22)
   goals met: 0 of 1
9. (move p22 p21)
   deleted: (at-robot p22)
   added: (at-robot p21)
   goals met: 0 of 1
10. (move p21 p28)
   deleted: (at-robot p21)
   added: (at-robot p28)
   goals met: 0 of 1
11. (unlock p28 p27 key1 shape1)
   deleted: (locked p27)
   added: (open p27)
   goals met: 0 of 1
12. (move p28 p27)
   deleted: (at-robot p28)
   added: (at-robot p27)
   goals met: 0 of 1
13. (move p27 p26)
   deleted: (at-robot p27)
   added: (at-robot p26)
   goals met: 0 of 1
14. (move p26 p25)
   deleted: (at-robot p26)
   added: (at-robot p25)
   goals met: 0 of 1
15. (move p25 p19)
   deleted: (at-robot p25)
   added: (at-robot p19)
   goals met: 0 of 1
16. (unlock p19 p18 key1 shape1)
   deleted: (locked p18)
   added: (open p18)
   goals met: 0 of 1
17. (move p19 p25)
   deleted: (at-robot p19)
   added: (at-robot p25)
   goals met: 0 of 1
18. (move p25 p26)
   deleted: (at-robot p25)
   added: (at-robot p26)
   goals met: 0 of 1
19. (move p26 p27)
   deleted: (at-robot p26)
   added: (at-robot p27)
   goals met: 0 of 1
20. (move p27 p28)
   deleted: (at-robot p27)
   added: (at-robot p28)
   goals met: 0 of 1
21. (move p28 p21)
   deleted: (at-robot p28)
   added: (at-robot p21)
   goals met: 0 of 1
22. (move p21 p22)
   deleted: (at-robot p21)
   added: (at-robot p22)
   goals met: 0 of 1
23. (pickup-and-loose p22 key0 key1)
   deleted: (holding key1) (at key0 p22)
   added: (holding key0) (at key1 p22)
   goals met: 0 of 1
24. (move p22 p21)
   deleted: (at-robot p22)
   added: (at-robot p21)
   goals met: 0 of 1
25. (move p21 p28)
   deleted: (at-robot p21)
   added: (at-robot p28)
   goals met: 0 of 1
26. (move p28 p27)
   deleted: (at-robot p28)
   added: (at-robot p27)
   goals met: 0 of 1
27. (move p27 p26)
   deleted: (at-robot p27)
   added: (at-robot p26)
   goals met: 0 of 1
28. (move p26 p25)
   deleted: (at-robot p26)
   added: (at-robot p25)
   goals met: 0 of 1
29. (move p25 p19)
   deleted: (at-robot p25)
   added: (at-robot p19)
   goals met: 0 of 1
30. (move p19 p18)
   deleted: (at-robot p19)
   added: (at-robot p18)
   goals met: 0 of 1
31. (move p18 p17)
   deleted: (at-robot p18)
   added: (at-robot p17)
   goals met: 0 of 1
32. (move p17 p24)
   deleted: (at-robot p17)
   added: (at-robot p24)
   goals met: 0 of 1
33. (unlock p24 p30 key0 shape0)
   deleted: (locked p30)
   added: (open p30)
   goals met: 0 of 1
34. (move p24 p17)
   deleted: (at-robot p24)
   added: (at-robot p17)
   goals met: 0 of 1
35. (move p17 p18)
   deleted: (at-robot p17)
   added: (at-robot p18)
   goals met: 0 of 1
36. (pickup-and-loose p18 key2 key0)
   deleted: (holding key0) (at key2 p18)
   added: (holding key2) (at key0 p18)
   goals met: 0 of 1
37. (move p18 p17)
   deleted: (at-robot p18)
   added: (at-robot p17)
   goals met: 0 of 1
38. (move p17 p24)
   deleted: (at-robot p17)
   added: (at-robot p24)
   goals met: 0 of 1
39. (move p24 p30)
   deleted: (at-robot p24)
   added: (at-robot p30)
   goals met: 0 of 1
40. (move p30 p32)
   deleted: (at-robot p30)
   added: (at-robot p32)
   goals met: 0 of 1
41. (move p32 p39)
   deleted: (at-robot p32)
   added: (at-robot p39)
   goals met: 0 of 1
42. (unlock p39 p40 key2 shape2)
   deleted: (locked p40)
   added: (open p40)
   goals met: 0 of 1
43. (move p39 p40)
   deleted: (at-robot p39)
   added: (at-robot p40)
   goals met: 0 of 1
44. (move p40 p41)
   deleted: (at-robot p40)
   added: (at-robot p41)
   goals met: 0 of 1
45. (move p41 p42)
   deleted: (at-robot p41)
   added: (at-robot p42)
   goals met: 0 of 1
46. (move p42 p34)
   deleted: (at-robot p42)
   added: (at-robot p34)
   goals met: 1 of 1
